In [1]:
%pip install ipython
%pip install seaborn
!pip install --upgrade datetime.

Requirement already satisfied: ipython in c:\users\usuario\anaconda3\lib\site-packages (7.31.1)
Requirement already satisfied: jedi>=0.16 in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (0.18.1)
Requirement already satisfied: decorator in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: colorama in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (0.4.5)
Requirement already satisfied: matplotlib-inline in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (0.1.6)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (3.0.20)
Requirement already satisfied: backcall in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (63.4.1)
Requirement already satisfied: pygments in c:\users\usuario\anaconda3\lib\site-packages (from ipython) (2.11.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\usuario\anaconda3\lib\site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\usuario\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\usuario\anaconda3\lib\site-packages (0.11.2)
Requirement already satisfied: pandas>=0.23 in c:\users\usuario\anaconda3\lib\site-packages (from seaborn) (1.4.4)
Requirement already satisfied: scipy>=1.0 in c:\users\usuario\anaconda3\lib\site-packages (from seaborn) (1.9.1)
Requirement already satisfied: numpy>=1.15 in c:\users\usuario\anaconda3\lib\site-packages (from seaborn) (1.21.5)
Requirement already satisfied: matplotlib>=2.2 in c:\users\usuario\anaconda3\lib\site-packages (from seaborn) (3.5.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.9)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: cycler>=0.10 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (9.2.0)
Requirement already satisfied: packaging>=20.0 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\usuario\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\usuario\anaconda3\lib\site-packages (from pandas>=0.23->seaborn) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\usuario\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

ERROR: Invalid requirement: 'datetime.'

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')

# para pintar
import pylab as plt
import seaborn as sns
import datetime
import re

# para que salga el grafico
%matplotlib inline

In [3]:
#empiezo la exploración de cada archivo .csv
#el primer archivo es actor. la columna last_update

df_actor=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\actor.csv')

df_actor

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
195       196       BELA        WALKEN  2006-02-15 04:34:33
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33

[200 rows x 4 columns]

In [4]:
last_update_actor = '2006-02-15 04:34:33'

In [5]:
df_actor = df_actor.drop('last_update', axis=1)

In [6]:
df_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [7]:
#para limpiarla he convertido la columna last_update en una variable ya que todos los datos eran el mismo.

In [8]:
df_category=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\category.csv')

df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [9]:
last_update_category = '2006-02-15 04:46:27'

In [10]:
df_category = df_category.drop('last_update', axis=1)

In [11]:
df_category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [12]:
#He hecho lo mismo para el archivo Category con la columna last_update

In [13]:
df_film=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\film.csv')

df_film

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,NaN,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,NaN,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,NaN,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,NaN,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,NaN,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [14]:
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [15]:
#Hay una columna que tiene todos sus valores nulos que elimino.
df_film = df_film.drop('original_language_id', axis=1)

In [16]:
last_update_film = '2006-02-15 05:03:42'

In [17]:
df_film = df_film.drop('last_update', axis=1)

In [18]:
df_film.dtypes

film_id               int64
title                object
description          object
release_year          int64
language_id           int64
rental_duration       int64
rental_rate         float64
length                int64
replacement_cost    float64
rating               object
special_features     object
dtype: object

In [19]:
df_film['description'] = df_film['description'].str.lower()

In [20]:
df_film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,a epic drama of a feminist and a mad scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,a astounding epistle of a database administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,a astounding reflection of a lumberjack and a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,a fanciful documentary of a frisbee and a lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,a fast-paced documentary of a pastry chef and ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [21]:
df_language=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\language.csv')

df_language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [22]:
df_language=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\language.csv')

df_language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [23]:
df_language = df_language.drop('last_update', axis=1)

In [24]:
df_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [25]:
df_oldhdd=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\old_HDD.csv')

df_oldhdd.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [26]:
df_rental=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\rental.csv')

df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [27]:
df_rental = df_rental.loc[df_rental['inventory_id'] <= 1000]

In [28]:
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53
20,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2,2006-02-15 21:30:53
21,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2,2006-02-15 21:30:53

In [29]:
df_rental = df_rental.drop('last_update', axis=1)

In [30]:
df_rental = df_rental.drop('customer_id', axis=1)

In [31]:
df_rental = df_rental.rename(columns={'staff_id': 'store_id'})

In [32]:
df_rental.head()

,rental_id,rental_date,inventory_id,return_date,store_id
0,1,2005-05-24 22:53:30,367,2005-05-26 22:04:30,1
15,16,2005-05-25 00:43:11,389,2005-05-26 04:42:11,2
16,17,2005-05-25 01:06:36,830,2005-05-27 00:43:36,1
20,21,2005-05-25 01:59:46,146,2005-05-26 01:01:46,2
21,22,2005-05-25 02:19:23,727,2005-05-26 04:52:23,2

In [33]:
df_rental.describe()

        rental_id  inventory_id    store_id
count  212.000000    212.000000  212.000000
mean   496.174528    489.462264    1.528302
std    286.503522    276.747003    0.500380
min      1.000000      2.000000    1.000000
25%    231.750000    248.250000    1.000000
50%    505.500000    489.000000    2.000000
75%    740.500000    724.000000    2.000000
max    995.000000    992.000000    2.000000

In [34]:
df_inventory=pd.read_csv(r'C:\Users\usuario\Desktop\w3-database-project\data\inventory.csv')

df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [35]:
df_inventory = df_inventory.drop('last_update', axis=1)

In [36]:
df_inventory = pd.merge(df_inventory, df_film, left_on=['film_id'], right_on=['film_id'])

In [37]:
df_new_inventory= df_inventory[['inventory_id', 'film_id', 'title']]

In [38]:
df_new_inventory

     inventory_id  film_id             title
0               1        1  ACADEMY DINOSAUR
1               2        1  ACADEMY DINOSAUR
2               3        1  ACADEMY DINOSAUR
3               4        1  ACADEMY DINOSAUR
4               5        1  ACADEMY DINOSAUR
..            ...      ...               ...
995           996      222   DESERT POSEIDON
996           997      222   DESERT POSEIDON
997           998      222   DESERT POSEIDON
998           999      223      DESIRE ALIEN
999          1000      223      DESIRE ALIEN

[1000 rows x 3 columns]

In [39]:
value_counts = df_new_inventory['title'].value_counts()

# Crear un nuevo dataframe a partir de los valores únicos contados
df_new2_inventory = pd.DataFrame({'title': value_counts.index, 'count': value_counts.values})

In [40]:
df_inventory = df_new_inventory

In [41]:
df_oldhdd = pd.merge(df_oldhdd, df_actor, left_on=['first_name', 'last_name'], right_on=['first_name', 'last_name'])

In [42]:
df_oldhdd = pd.merge(df_oldhdd, df_film, left_on=['title'], right_on=['title'])

In [43]:
df_oldhdd = df_oldhdd.drop('first_name', axis=1)

In [44]:
df_oldhdd = df_oldhdd.drop('last_name', axis=1)

In [45]:
df_oldhdd = df_oldhdd.drop('release_year_x', axis=1)

In [46]:
df_oldhdd = df_oldhdd.drop('description', axis=1)

In [47]:
df_oldhdd = df_oldhdd.drop('release_year_y', axis=1)

In [48]:
df_oldhdd = df_oldhdd.drop('language_id', axis=1)

In [49]:
df_oldhdd = df_oldhdd.drop('rental_duration', axis=1)

In [50]:
df_oldhdd = df_oldhdd.drop('rental_rate', axis=1)

In [51]:
df_oldhdd = df_oldhdd.drop('length', axis=1)

In [52]:
df_oldhdd = df_oldhdd.drop('rating', axis=1)

In [53]:
df_oldhdd = df_oldhdd.drop('special_features', axis=1)

In [54]:
df_oldhdd = df_oldhdd.drop('replacement_cost', axis=1)

In [55]:
df_oldhdd.head()

                  title  category_id  actor_id  film_id
0      ACADEMY DINOSAUR            6         1        1
1      ACADEMY DINOSAUR            6        10        1
2      ACADEMY DINOSAUR            6        20        1
3      ACADEMY DINOSAUR            6        30        1
4  ANACONDA CONFESSIONS            2         1       23

In [56]:
df_oldhdd.describe()

       category_id     actor_id      film_id
count  1000.000000  1000.000000  1000.000000
mean      8.355000    19.834000   484.974000
std       4.726872    10.742059   289.899384
min       1.000000     1.000000     1.000000
25%       4.000000    11.000000   226.000000
50%       8.000000    20.000000   484.500000
75%      13.000000    28.000000   733.250000
max      16.000000    39.000000   998.000000

In [57]:
df_film.dtypes

film_id               int64
title                object
description          object
release_year          int64
language_id           int64
rental_duration       int64
rental_rate         float64
length                int64
replacement_cost    float64
rating               object
special_features     object
dtype: object

In [58]:
df_oldhdd = df_oldhdd.drop('title', axis=1)

In [59]:
df_film = pd.merge(df_film, df_oldhdd, left_on=['film_id'], right_on=['film_id'])

In [60]:
df_oldhdd = df_oldhdd.drop('category_id', axis=1)

In [61]:
df_film = df_film.drop('actor_id', axis=1)

In [62]:
df_oldhdd.head()

   actor_id  film_id
0         1        1
1        10        1
2        20        1
3        30        1
4         1       23

In [63]:
df_film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,a epic drama of a feminist and a mad scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
1,1,ACADEMY DINOSAUR,a epic drama of a feminist and a mad scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
2,1,ACADEMY DINOSAUR,a epic drama of a feminist and a mad scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
3,1,ACADEMY DINOSAUR,a epic drama of a feminist and a mad scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
4,2,ACE GOLDFINGER,a astounding epistle of a database administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11

In [64]:
df_actor.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\actor.csv', index=False)

In [65]:
df_category.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\category.csv', index=False)

In [66]:
df_film.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\film.csv', index=False)

In [67]:
df_inventory.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\inventory.csv', index=False)

In [68]:
df_language.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\language.csv', index=False)

In [69]:
df_oldhdd.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\discoduro.csv', index=False)

In [70]:
df_rental.to_csv(r'C:\Users\usuario\Desktop\sql-data-base-building\rental.csv', index=False)

In [71]:
df_film.dtypes

film_id               int64
title                object
description          object
release_year          int64
language_id           int64
rental_duration       int64
rental_rate         float64
length                int64
replacement_cost    float64
rating               object
special_features     object
category_id           int64
dtype: object

In [72]:
df_inventory.head()

   inventory_id  film_id             title
0             1        1  ACADEMY DINOSAUR
1             2        1  ACADEMY DINOSAUR
2             3        1  ACADEMY DINOSAUR
3             4        1  ACADEMY DINOSAUR
4             5        1  ACADEMY DINOSAUR

In [73]:
df_inventory = df_inventory.drop('title', axis=1)

In [74]:
df_rental.head()

,rental_id,rental_date,inventory_id,return_date,store_id
0,1,2005-05-24 22:53:30,367,2005-05-26 22:04:30,1
15,16,2005-05-25 00:43:11,389,2005-05-26 04:42:11,2
16,17,2005-05-25 01:06:36,830,2005-05-27 00:43:36,1
20,21,2005-05-25 01:59:46,146,2005-05-26 01:01:46,2
21,22,2005-05-25 02:19:23,727,2005-05-26 04:52:23,2

In [75]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\usuario\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\usuario\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [76]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\usuario\anaconda3\lib\site-packages (1.0.2)Note: you may need to restart the kernel to use updated packages.

In [77]:
from sqlalchemy import create_engine

In [78]:

str_conn = 'mysql+pymysql://root:crislaumar91202@localhost:3306/films'

cursor = create_engine(str_conn)

In [80]:
df_oldhdd.to_sql(name='disco_duro', con=cursor, if_exists='replace', index=False)

1000

In [81]:
df_actor.to_sql(name='actor', con=cursor, if_exists='replace', index=False)

200

In [84]:
df_rental = df_rental.drop('rental_date', axis=1)

In [85]:
df_rental = df_rental.drop('return_date', axis=1)

In [86]:
df_rental = df_rental.drop('store_id', axis=1)

In [87]:
df_rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

212

In [88]:
df_inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1000

In [89]:
df_film.to_sql(name='film', con=cursor, if_exists='replace', index=False)

1000

In [90]:
df_category.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [91]:
df_language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6